# parents = ["レディース"]
#  "メンズ", "ベビー・キッズ", "インテリア・住まい・小物", "本・音楽・ゲーム",
  # "おもちゃ・ホビー・グッズ", "コスメ・香水・美容", "家電・スマホ・カメラ", "スポーツ・レジャー",
  # "ハンドメイド" ,"チケット" ,"自動車・オートバイ" ,"その他"

# children = [
            # レディースの子
            # ["トップス","ジャケット","パンツ","スカート","ワンピース","靴","ルームウェア/パジャマ","レッグウェア",
            #   "帽子","バッグ","アクセサリー","ヘアアクセサリー","小物","時計","ウィッグ/エクステ","浴衣/水着",
            #   "スーツ/フォーマル/ドレス","マタニティ","その他"]
            # # メンズの子
            # ["トップス","ジャケット/アウター","パンツ","靴","バッグ","スーツ","帽子","アクセサリー","小物","時計","水着","レッグウェア","その他"],
            # # ベビー・キッズの子
            # ["ベビー服(女の子用) ~95cm","ベビー服(男の子用) ~95cm","ベビー服(男女兼用) ~95cm","キッズ服(女の子用) 100cm~","キッズ服(男の子用) ~100cm",
            #   "キッズ服(男女兼用) 100cm","キッズ靴","子供用ファッション小物","おむつ/トイレ/バス","外出/移動用品","授乳/食事","ベビー家具/寝具/室内用品","おもちゃ","行事/記念品","その他"],
            # # インテリア・住まい・小物の子
            # ["キッチン/食器","ベッド/マットレス","ソファ/ソファベッド","椅子/チェア","机/テーブル","収納家具",
            #   "ラグ/カーペット/マット","カーテン/ブラインド","ライト/照明","寝具","インテリア小物","季節/年中行事"],
            # # 本・音楽・ゲームの子
            # ["本","漫画","雑誌","CD","DVD/ブルーレイ","レコード","テレビゲーム"],
            # # おもちゃ・ホビー・グッズの子
            # ["おもちゃ","タレントグッズ","コミック/アニメグッズ","トレーディングカード","フィギュア","楽器/器材","コレクション",
            #   "ミリタリー","美術品","アート用品","その他"],
            # # コスメ・香水・美容の子
            # ["ベースメイク","メイクアップ","ネイルケア","香水","スキンケア/基礎化粧品","ヘアケア",
            #   "ボディケア","オーラルケア","リラクゼーション","ダイエット","その他"],
            # # 家電・スマホ・カメラの子
            # ["スマートフォン/携帯電話","スマホアクセサリー","PC/タブレット","カメラ","テレビ/映像機器",
            #   "オーディオ機器","美容/健康","冷暖房/空調","生活家電","その他"],
            # # スポーツ・レジャーの子
            # ["ゴルフ","フィッシング","自転車","トレーニング/エクササイズ","野球","サッカー/フットサル","テニス",
            #   "スノーボード","スキー","その他スポーツ","アウトドア","その他"],
            # # ハンドメイドの子
            # ["アクセサリー(女性用)""ファッション/小物","アクセサリー/時計","日用品/インテリア","趣味/おもちゃ",
            #   "キッズ/ベビー","素材/材料","二次創作物"],
            # # チケットの子
            # ["音楽","スポーツ","演劇/芸能","イベント","映画","施設利用券","優待券/割引券"],
            # # 自動車・オートバイの子
            # ["自動車本体","自動車タイヤ/ホイール","自動車パーツ","自動車アクセサリー","オートバイ車体",
            #   "オートバイパーツ","オートバイアクセサリ"],
            # # その他の子
            # ["まとめ売り","ペット用品","食品","飲料/酒","日用品/生活雑貨/旅行","アンティーク/コレクション",
            #   "文房具/事務用品","事務/店舗用","その他"]
          # ]

# grand_children = [
                  #レディースの孫
                      #トップス
                      # ["Tシャツ/カットソー(半袖/袖なし)","Tシャツ/カットソー(七分/長袖)","シャツ/ブラウス(半袖/袖なし)","シャツ/ブラウス(七分/長袖)","ポロシャツ",
                      #   "キャミソール","タンクトップ","ホルターネック","ニット/セーター","チュニック","カーディガン/ボレロ","アンサンブル","ベスト/ジレ",
                      #   "パーカー","トレーナー/スウェット","ベアトップ/チューブトップ","ジャージ","その他"],
                      #ジャケット/アウター
                      # ["テーラードジャケット","ノーカラージャケット","デニムジャケット","レザージャケット","ダウン 
                      #   ジャケット","ライダースジャケット","ミリタリージャケット","ダウンベスト","ジャンパー/ブルゾン","ポンチョ",
                      #   "ロングコート","トレンチコート","ダッフルコート","ピーコート","チェスターコート","モッズコート","スタジャン",
                      #   "毛皮/ファーコート","スプリングコート","スカジャン","その他"],
                      #パンツ
                      # ["デニム/ジーンズ","ショートパンツ","カジュアルパンツ","ハーフパンツ","チノパン","ワークパンツ","クロップドパンツ","サロペット/オーバーオール",
                      #   "オールインワン","サルエルパンツ","ガウチョパンツ","その他"],
                      #スカート
                      # ["ミニスカート","ひざ丈スカート","ロングスカート","キュロット","その他"],
                      #ワンピース
                      # ["ミニワンピース","膝丈ワンピース","ロングワンピース","その他"],
                      #靴
                      # ["ハイヒール/パンプス","ブーツ","サンダル","スニーカー","ミュール","モカシン","ローファー/革靴","フラットシューズ/バレエシューズ","長靴/レインシューズ","その他"],
                      #ルームウェア/パジャマ
                      # ["パジャマ","ルームウェア"],
                      #レッグウェア
                      # ["ソックス","スパッツ/レギンス","ストッキング/タイツ","レッグウォーマー","その他"],
                      #帽子
                      # ["ニットキャップ/ビーニー","ハット","ハンチング/ベレー帽","キャップ","キャスケット","麦わら帽子","その他"],
                      #バッグ
                      # ["ハンドバッグ","トートバッグ","エコバッグ","リュック/バックパック","ボストンバッグ","スポーツバッグ","ショルダーバッグ","クラッチバッグ","ポーチ/バニティ",
                        # "ボディバッグ/ウェストバッグ","マザーズバッグ","メッセンジャーバッグ","ビジネスバッグ","旅行用バッグ/キャリーバッグ","ショップ袋","和装用バッグ","かごバッグ","その他"],
                      #アクセサリー
                      # ["ネックレス","ブレスレット","バングル/リストバンド","リング","ピアス(片耳用)","ピアス(両耳用)","イヤリング","アンクレット","ブローチ/コサージュ","チャーム","その他"],
                      #ヘアアクセサリー
                      # ["ヘアゴム/シュシュ","ヘアバンド/カチューシャ","ヘアピン","その他"]
                      #小物
                      # ["長財布","折り財布","コインケース/小銭入れ","名刺入れ/定期入れ","キーケース","キーホルダー","手袋/アームカバー","ハンカチ","ベルト","マフラー/ショール",
                        # "ストール/スヌード","バンダナ/スカーフ","ネックウォーマー","サスペンダー","サングラス/メガネ","モバイルケース/カバー","手帳","イヤマフラー","傘",
                        # "レインコート/ポンチョ","ミラー","タバコグッズ","その他"],
                      #時計
                      # ["腕時計(アナログ)","腕時計(デジタル)","ラバーベルト","レザーベルト","金属ベルト","その他"],
                      #ウィッグ/エクステ
                      # ["前髪ウィッグ","ロングストレート","ロングカール","ショートストレート","ショートカール","その他"],
                      #浴衣/水着
                      # ["浴衣","着物","振袖","長襦袢","半襦袢","水着セパレート","水着ワンピース","水着スポーツ用","その他"],
                      #スーツ/フォーマルドレス
                      # ["スカートスーツ上下","パンツスーツ上下","ドレス","パーティーバッグ","シューズ","ウェディング","その他"],
                      #マタニティ
                      # ["トップス","アウター","インナー","ワンピース","パンツ/スパッツ","スカート","パジャマ","授乳服","その他"],
                      #その他
                      # ["コスプレ","下着","その他"],

                  #メンズの孫
                      #トップス
                      # ["Tシャツ/カットソー(半袖/袖なし)","Tシャツ/カットソー(七分/長袖)","シャツ","ポロシャツ",
                      # "タンクトップ","ニット/セーター","パーカー","カーディガン","スウェット","ジャージ","ベスト","その他"],
                      #ジャケット/アウター
                      # ["テーラードジャケット","ノーカラージャケット","Gジャン/デニムジャケット","レザージャケット","ダウンジャケット",
                      # "ライダースジャケット","ミリタリージャケット","ナイロンジャケット","フライトジャケット","ダッフルコート","ピーコート",
                      # "ステンカラーコート","トレンチコート","モッズコート","チェスターコート","スタジャン","スカジャン",
                      # "ブルゾン","マウンテンパーカー","ダウンベスト","ポンチョ","カバーオール","その他"],
        # ]


# parents.each do |parent|
#   Category.create(name: parent)
# end

# @parents = Category.where(ancestry: nil)

# c = 0
# @parents.each do |parent|
#   children[c].each do |child|
#     parent.children.create(name: child)
#     end
#   c += 1
# end

# g =0
# @parents.each do |parent|
#   index = parent.id

#   @children = Category.where(ancestry: index)

#     @children.each do |child|
#       grand_children[g].each do |grand_child|
#         child.children.create(name: grand_child)
#       end
#     g += 1
#     end
# end

# レディース
ladies_child_array = ['トップス','ジャケット/アウター','パンツ','スカート','ワンピース','靴','ルームウェア/パジャマ','レッグウェア','帽子','バッグ','アクセサリー','ヘアアクセサリー','小物','時計']
#２階層目(子)のカテゴーを準備
ladies_grandchild_array = [
  #３階層目(孫)のカテゴーを２重配列で準備
  ['Tシャツ/カットソー(半袖/袖なし)','Tシャツ/カットソー(七分/長袖)','シャツ/ブラウス(半袖/袖なし)','シャツ/ブラウス(七分/長袖)','ポロシャツ','キャミソール','タンクトップ','ホルターネック','ニット/セーター','チュニック','カーディガン/ボレロ','アンサンブル','ベスト/ジレ','パーカー'],
  ['テーラードジャケット','ノーカラージャケット','Gジャン/デニムジャケット','レザージャケット','ダウンジャケット','ライダースジャケット','ミリタリージャケット','ダウンベスト','ジャンパー/ブルゾン','ポンチョ','ロングコート','トレンチコート','ダッフルコート','ピーコート'],
  ['デニム/ジーンズ','ショートパンツ','カジュアルパンツ','ハーフパンツ','チノパン','ワークパンツ/カーゴパンツ','クロップドパンツ','サロペット/オーバーオール','オールインワン','サルエルパンツ','ガウチョパンツ','その他'],
  ['ミニスカート','ひざ丈スカート','ロングスカート','キュロット','その他'],
  ['ミニワンピース','ひざ丈ワンピース','ロングワンピース','その他'],
  ['ハイヒール/パンプス','ブーツ','サンダル','スニーカー','ミュール','モカシン','ローファー/革靴','フラットシューズ/バレエシューズ','長靴/レインシューズ','その他'],
  ['パジャマ','ルームウェア'],
  ['ソックス','スパッツ/レギンス','ストッキング/タイツ','レッグウォーマー','その他'],
  ['ニットキャップ/ビーニー','ハット','ハンチング/ベレー帽','キャップ','キャスケット','麦わら帽子','その他'],
  ['ハンドバッグ','トートバッグ','エコバッグ','リュック/バックパック','ボストンバッグ','スポーツバッグ','ショルダーバッグ','クラッチバッグ','ポーチ/バニティ','ボディバッグ/ウェストバッグ','マザーズバッグ','メッセンジャーバッグ','ビジネスバッグ','旅行用バッグ/キャリーバッグ'],
  ['ネックレス','ブレスレット','バングル/リストバンド','リング','ピアス(片耳用)','ピアス(両耳用)','イヤリング','アンクレット','ブローチ/コサージュ','チャーム','その他'],
  ['ヘアゴム/シュシュ','ヘアバンド/カチューシャ','ヘアピン','その他'],
  ['長財布','折り財布','コインケース/小銭入れ','名刺入れ/定期入れ','キーケース','キーホルダー','手袋/アームカバー','ハンカチ','ベルト','マフラー/ショール','ストール/スヌード','バンダナ/スカーフ','ネックウォーマー','サスペンダー'],
  ['腕時計(アナログ)','腕時計(デジタル)','ラバーベルト','レザーベルト','金属ベルト','その他']
]
parent = Category.create(name: 'レディース')
# １階層目(親)のカテゴリーを作成

ladies_child_array.each_with_index do |child, i|
  # 2階層目(子)のカテゴリー配列から１つずつ取り出す
  child = parent.children.create(name: child)
  # 取りだりた2階層目(子)のカテゴリーを作成
  ladies_grandchild_array[i].each do |grandchild|
  # ３階層目(孫)のi番目のカテゴリー配列から１つずつ取り出す
    child.children.create(name: grandchild)
    # 取りだした３階層目(孫)のカテゴリーを作成
  end
end

